{
  "ml" : {
    "head" : [
      "<a href=\"https://nanoml.org\">Machine Learning Team Lead</a>",
      "Founder and Lead",
      "Purdue University",
      "2021 - "
    ],
    "body" : [
      " Raised $27k in computing resources through grants, saved $40k in ML costs through server maintenance, and assisted in raising $200k+ for the <a href=\"https://www.ornl.gov/news/quantum-science-center-concludes-second-annual-summer-school-style\">QSC Summer Schools</a>. ",
      " Created quantum machine learning algorithms for designing meta-optical devices, achieving a 16200% quantum speed-up resulting in a major milestone for the <a href=\"https://pubs.aip.org/aip/sci/article/2021/53/531104/365746/Framework-maps-continuous-space-inverse-design\">Quantum Science Center</a> with two news articles and 18 citations <a href=\"https://engineering.purdue.edu/ECE/News/2022/ece-researchers-develop-quantum-machine-learning-algorithm-for-optimizing-arbitrary-engineering-problems\">[1]</a>.",
      "Led 6 researchers to develop transformer ML algorithms for tackling the $75B counterfeit chip market leading to a 55,000x speed-up and 41% accuracy increase in the verification of semiconductor devices. Submitted to CVPR 2024. Patent in progress. "
    ]
  },
  "quera" : {
    "head" : [
              "Quantum Machine Learning",
              "Algorithms Researcher",
              "QuEra Computing",
              "2022"
            ],
    "body" : [
              "Demonstrated quantum advantage on neutral atoms for generative AI sampling of photonic devices. Publication and patent are underway.",
      " Set team research objectives and wrote quantum simulation software in Python and Julia to simulate Rydberg atom systems for analysis.",
              "Verified early-access, open-source, flagship neutral atom simulation software <a href=\"https://www.quera.com/bloqade/\">Bloqade</a> on machine learning sampling tasks."
          ]
         },
  "uav" : {
      "head" : [
        "UAV Routing Algorithms",
        "Researcher",
        "Air Force Research Lab",
        "2017 - 2022"
      ],
    "body" : [
       "Derived <a href=\"https://arxiv.org/pdf/2110.09917.pdf\">optimal UAV routes </a> for search and rescue missions to choose deliveries based on a tradeoff of risk of failure and reward. ",
       "Created <a href=\"https://arxiv.org/abs/2009.08549\">sweep-covers</a> for partitioning road-networks for <a href=\"https://static1.squarespace.com/static/5e4db081c73d161dcd6e2daf/t/5fc59ae6f81c9a2a0c646064/1606785768093/Multiple_Pursuers_Under_Partial_Information_by_Sweep_Covers__Copy_+%2810%29.pdf\">multi-UAV routing</a> to capture ground-vehicles. "
  ]
  },
  "arm" : {
    "head" : [
      "Computer Architecture Design",
      "Software Engineer",
      "ARM",
      "2019"
    ],
    "body" : [
        "Engineered verification software in Python, XML, and C++ for ARMv8 instruction set coverage, leading to a 250% improvement in Chi-Square randomness and immediate positive feedback from customers for improving test consistency.",
        "Rebuilt 2 ARMv8 debug intruction tests in ARM's verification suite to reduce the complexity of debugging for customers.",
       "Designed a 32-Bit MIPS RISC processor in Verilog with L1-Cache and 5-stage pipeline. Compiled C to MIPS IS and benchmarked on FPGA's.  ",
        "Developed Python to RISCV transpiler for generating Verilog Read-Only-Memory for RISCV-based <a href=\"https://engineering.purdue.edu/SoC-Team/AFTx-Previous\">System-on-Chip</a>. "
  ]
  }
}
